examples_wave_flume/mesh_convergence_study/case2_regular/2CPH/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

turbLengthScale 0.147;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    $turbLengthScale;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.001;
        value           uniform 0.001;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.001;
        value           uniform 0.001;
    }
    bottom
    {
        type            omegaWallFunction;
        value           uniform 0.001;
    }
}


// ************************************************************************* //

